BATCH NORM PARAMETERS
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 32, 32]           1,024
       BatchNorm2d-2           [-1, 64, 32, 32]             128
            Conv2d-3           [-1, 64, 32, 32]          36,864
       BatchNorm2d-4           [-1, 64, 32, 32]             128
            Conv2d-5          [-1, 256, 32, 32]          16,384
       BatchNorm2d-6          [-1, 256, 32, 32]             512
            Conv2d-7          [-1, 256, 32, 32]           4,096
       BatchNorm2d-8          [-1, 256, 32, 32]             512
        Bottleneck-9          [-1, 256, 32, 32]               0
           Conv2d-10           [-1, 64, 32, 32]          16,384
      BatchNorm2d-11           [-1, 64, 32, 32]             128
           Conv2d-12           [-1, 64, 32, 32]          36,864
      BatchNorm2d-13           [-1, 64, 32, 32]             128
           Conv2d-14          [-1, 256, 32, 32]          16,384
      BatchNorm2d-15          [-1, 256, 32, 32]             512
       Bottleneck-16          [-1, 256, 32, 32]               0
           Conv2d-17           [-1, 64, 32, 32]          16,384
      BatchNorm2d-18           [-1, 64, 32, 32]             128
           Conv2d-19           [-1, 64, 32, 32]          36,864
      BatchNorm2d-20           [-1, 64, 32, 32]             128
           Conv2d-21          [-1, 256, 32, 32]          16,384
      BatchNorm2d-22          [-1, 256, 32, 32]             512
       Bottleneck-23          [-1, 256, 32, 32]               0
           Conv2d-24          [-1, 128, 32, 32]          32,768
      BatchNorm2d-25          [-1, 128, 32, 32]             256
           Conv2d-26          [-1, 128, 16, 16]         147,456
      BatchNorm2d-27          [-1, 128, 16, 16]             256
           Conv2d-28          [-1, 512, 16, 16]          65,536
      BatchNorm2d-29          [-1, 512, 16, 16]           1,024
           Conv2d-30          [-1, 512, 16, 16]         131,072
      BatchNorm2d-31          [-1, 512, 16, 16]           1,024
       Bottleneck-32          [-1, 512, 16, 16]               0
           Conv2d-33          [-1, 128, 16, 16]          65,536
      BatchNorm2d-34          [-1, 128, 16, 16]             256
           Conv2d-35          [-1, 128, 16, 16]         147,456
      BatchNorm2d-36          [-1, 128, 16, 16]             256
           Conv2d-37          [-1, 512, 16, 16]          65,536
      BatchNorm2d-38          [-1, 512, 16, 16]           1,024
       Bottleneck-39          [-1, 512, 16, 16]               0
           Conv2d-40          [-1, 128, 16, 16]          65,536
      BatchNorm2d-41          [-1, 128, 16, 16]             256
           Conv2d-42          [-1, 128, 16, 16]         147,456
      BatchNorm2d-43          [-1, 128, 16, 16]             256
           Conv2d-44          [-1, 512, 16, 16]          65,536
      BatchNorm2d-45          [-1, 512, 16, 16]           1,024
       Bottleneck-46          [-1, 512, 16, 16]               0
           Conv2d-47          [-1, 128, 16, 16]          65,536
      BatchNorm2d-48          [-1, 128, 16, 16]             256
           Conv2d-49          [-1, 128, 16, 16]         147,456
      BatchNorm2d-50          [-1, 128, 16, 16]             256
           Conv2d-51          [-1, 512, 16, 16]          65,536
      BatchNorm2d-52          [-1, 512, 16, 16]           1,024
       Bottleneck-53          [-1, 512, 16, 16]               0
           Conv2d-54          [-1, 256, 16, 16]         131,072
      BatchNorm2d-55          [-1, 256, 16, 16]             512
           Conv2d-56            [-1, 256, 8, 8]         589,824
      BatchNorm2d-57            [-1, 256, 8, 8]             512
           Conv2d-58           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-59           [-1, 1024, 8, 8]           2,048
           Conv2d-60           [-1, 1024, 8, 8]         524,288
      BatchNorm2d-61           [-1, 1024, 8, 8]           2,048
       Bottleneck-62           [-1, 1024, 8, 8]               0
           Conv2d-63            [-1, 256, 8, 8]         262,144
      BatchNorm2d-64            [-1, 256, 8, 8]             512
           Conv2d-65            [-1, 256, 8, 8]         589,824
      BatchNorm2d-66            [-1, 256, 8, 8]             512
           Conv2d-67           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-68           [-1, 1024, 8, 8]           2,048
       Bottleneck-69           [-1, 1024, 8, 8]               0
           Conv2d-70            [-1, 256, 8, 8]         262,144
      BatchNorm2d-71            [-1, 256, 8, 8]             512
           Conv2d-72            [-1, 256, 8, 8]         589,824
      BatchNorm2d-73            [-1, 256, 8, 8]             512
           Conv2d-74           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-75           [-1, 1024, 8, 8]           2,048
       Bottleneck-76           [-1, 1024, 8, 8]               0
           Conv2d-77            [-1, 256, 8, 8]         262,144
      BatchNorm2d-78            [-1, 256, 8, 8]             512
           Conv2d-79            [-1, 256, 8, 8]         589,824
      BatchNorm2d-80            [-1, 256, 8, 8]             512
           Conv2d-81           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-82           [-1, 1024, 8, 8]           2,048
       Bottleneck-83           [-1, 1024, 8, 8]               0
           Conv2d-84            [-1, 256, 8, 8]         262,144
      BatchNorm2d-85            [-1, 256, 8, 8]             512
           Conv2d-86            [-1, 256, 8, 8]         589,824
      BatchNorm2d-87            [-1, 256, 8, 8]             512
           Conv2d-88           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-89           [-1, 1024, 8, 8]           2,048
       Bottleneck-90           [-1, 1024, 8, 8]               0
           Conv2d-91            [-1, 256, 8, 8]         262,144
      BatchNorm2d-92            [-1, 256, 8, 8]             512
           Conv2d-93            [-1, 256, 8, 8]         589,824
      BatchNorm2d-94            [-1, 256, 8, 8]             512
           Conv2d-95           [-1, 1024, 8, 8]         262,144
      BatchNorm2d-96           [-1, 1024, 8, 8]           2,048
       Bottleneck-97           [-1, 1024, 8, 8]               0
           Conv2d-98            [-1, 512, 8, 8]         524,288
      BatchNorm2d-99            [-1, 512, 8, 8]           1,024
          Conv2d-100            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-101            [-1, 512, 4, 4]           1,024
          Conv2d-102           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-103           [-1, 2048, 4, 4]           4,096
          Conv2d-104           [-1, 2048, 4, 4]       2,097,152
     BatchNorm2d-105           [-1, 2048, 4, 4]           4,096
      Bottleneck-106           [-1, 2048, 4, 4]               0
          Conv2d-107            [-1, 512, 4, 4]       1,048,576
     BatchNorm2d-108            [-1, 512, 4, 4]           1,024
          Conv2d-109            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-110            [-1, 512, 4, 4]           1,024
          Conv2d-111           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-112           [-1, 2048, 4, 4]           4,096
      Bottleneck-113           [-1, 2048, 4, 4]               0
          Conv2d-114            [-1, 512, 4, 4]       1,048,576
     BatchNorm2d-115            [-1, 512, 4, 4]           1,024
          Conv2d-116            [-1, 512, 4, 4]       2,359,296
     BatchNorm2d-117            [-1, 512, 4, 4]           1,024
          Conv2d-118           [-1, 2048, 4, 4]       1,048,576
     BatchNorm2d-119           [-1, 2048, 4, 4]           4,096
      Bottleneck-120           [-1, 2048, 4, 4]               0
          Linear-121                   [-1, 10]          20,490
================================================================
Total params: 23,503,626
Trainable params: 23,503,626
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.06
Forward/backward pass size (MB): 65.13
Params size (MB): 89.66
Estimated Total Size (MB): 154.85
----------------------------------------------------------------
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 16, 32, 32]             432
       BatchNorm2d-2           [-1, 16, 32, 32]              32
            Conv2d-3           [-1, 16, 32, 32]             256
       BatchNorm2d-4           [-1, 16, 32, 32]              32
            Conv2d-5           [-1, 16, 32, 32]           2,304
       BatchNorm2d-6           [-1, 16, 32, 32]              32
            Conv2d-7           [-1, 64, 32, 32]           1,024
       BatchNorm2d-8           [-1, 64, 32, 32]             128
            Conv2d-9           [-1, 64, 32, 32]           1,024
      BatchNorm2d-10           [-1, 64, 32, 32]             128
       Bottleneck-11           [-1, 64, 32, 32]               0
           Conv2d-12           [-1, 16, 32, 32]           1,024
      BatchNorm2d-13           [-1, 16, 32, 32]              32
           Conv2d-14           [-1, 16, 32, 32]           2,304
      BatchNorm2d-15           [-1, 16, 32, 32]              32
           Conv2d-16           [-1, 64, 32, 32]           1,024
      BatchNorm2d-17           [-1, 64, 32, 32]             128
       Bottleneck-18           [-1, 64, 32, 32]               0
AdaptiveAvgPool2d-19             [-1, 64, 1, 1]               0
           Linear-20                   [-1, 10]             650
================================================================
Total params: 10,586
Trainable params: 10,586
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 5.25
Params size (MB): 0.04
Estimated Total Size (MB): 5.30
----------------------------------------------------------------
GROUP NORM PARAMETERS
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 32, 32]           1,024
         GroupNorm-2           [-1, 64, 32, 32]             128
            Conv2d-3           [-1, 64, 32, 32]          36,864
         GroupNorm-4           [-1, 64, 32, 32]             128
            Conv2d-5          [-1, 256, 32, 32]          16,384
         GroupNorm-6          [-1, 256, 32, 32]             512
            Conv2d-7          [-1, 256, 32, 32]           4,096
         GroupNorm-8          [-1, 256, 32, 32]             512
        Bottleneck-9          [-1, 256, 32, 32]               0
           Conv2d-10           [-1, 64, 32, 32]          16,384
        GroupNorm-11           [-1, 64, 32, 32]             128
           Conv2d-12           [-1, 64, 32, 32]          36,864
        GroupNorm-13           [-1, 64, 32, 32]             128
           Conv2d-14          [-1, 256, 32, 32]          16,384
        GroupNorm-15          [-1, 256, 32, 32]             512
       Bottleneck-16          [-1, 256, 32, 32]               0
           Conv2d-17           [-1, 64, 32, 32]          16,384
        GroupNorm-18           [-1, 64, 32, 32]             128
           Conv2d-19           [-1, 64, 32, 32]          36,864
        GroupNorm-20           [-1, 64, 32, 32]             128
           Conv2d-21          [-1, 256, 32, 32]          16,384
        GroupNorm-22          [-1, 256, 32, 32]             512
       Bottleneck-23          [-1, 256, 32, 32]               0
           Conv2d-24          [-1, 128, 32, 32]          32,768
        GroupNorm-25          [-1, 128, 32, 32]             256
           Conv2d-26          [-1, 128, 16, 16]         147,456
        GroupNorm-27          [-1, 128, 16, 16]             256
           Conv2d-28          [-1, 512, 16, 16]          65,536
        GroupNorm-29          [-1, 512, 16, 16]           1,024
           Conv2d-30          [-1, 512, 16, 16]         131,072
        GroupNorm-31          [-1, 512, 16, 16]           1,024
       Bottleneck-32          [-1, 512, 16, 16]               0
           Conv2d-33          [-1, 128, 16, 16]          65,536
        GroupNorm-34          [-1, 128, 16, 16]             256
           Conv2d-35          [-1, 128, 16, 16]         147,456
        GroupNorm-36          [-1, 128, 16, 16]             256
           Conv2d-37          [-1, 512, 16, 16]          65,536
        GroupNorm-38          [-1, 512, 16, 16]           1,024
       Bottleneck-39          [-1, 512, 16, 16]               0
           Conv2d-40          [-1, 128, 16, 16]          65,536
        GroupNorm-41          [-1, 128, 16, 16]             256
           Conv2d-42          [-1, 128, 16, 16]         147,456
        GroupNorm-43          [-1, 128, 16, 16]             256
           Conv2d-44          [-1, 512, 16, 16]          65,536
        GroupNorm-45          [-1, 512, 16, 16]           1,024
       Bottleneck-46          [-1, 512, 16, 16]               0
           Conv2d-47          [-1, 128, 16, 16]          65,536
        GroupNorm-48          [-1, 128, 16, 16]             256
           Conv2d-49          [-1, 128, 16, 16]         147,456
        GroupNorm-50          [-1, 128, 16, 16]             256
           Conv2d-51          [-1, 512, 16, 16]          65,536
        GroupNorm-52          [-1, 512, 16, 16]           1,024
       Bottleneck-53          [-1, 512, 16, 16]               0
           Conv2d-54          [-1, 256, 16, 16]         131,072
        GroupNorm-55          [-1, 256, 16, 16]             512
           Conv2d-56            [-1, 256, 8, 8]         589,824
        GroupNorm-57            [-1, 256, 8, 8]             512
           Conv2d-58           [-1, 1024, 8, 8]         262,144
        GroupNorm-59           [-1, 1024, 8, 8]           2,048
           Conv2d-60           [-1, 1024, 8, 8]         524,288
        GroupNorm-61           [-1, 1024, 8, 8]           2,048
       Bottleneck-62           [-1, 1024, 8, 8]               0
           Conv2d-63            [-1, 256, 8, 8]         262,144
        GroupNorm-64            [-1, 256, 8, 8]             512
           Conv2d-65            [-1, 256, 8, 8]         589,824
        GroupNorm-66            [-1, 256, 8, 8]             512
           Conv2d-67           [-1, 1024, 8, 8]         262,144
        GroupNorm-68           [-1, 1024, 8, 8]           2,048
       Bottleneck-69           [-1, 1024, 8, 8]               0
           Conv2d-70            [-1, 256, 8, 8]         262,144
        GroupNorm-71            [-1, 256, 8, 8]             512
           Conv2d-72            [-1, 256, 8, 8]         589,824
        GroupNorm-73            [-1, 256, 8, 8]             512
           Conv2d-74           [-1, 1024, 8, 8]         262,144
        GroupNorm-75           [-1, 1024, 8, 8]           2,048
       Bottleneck-76           [-1, 1024, 8, 8]               0
           Conv2d-77            [-1, 256, 8, 8]         262,144
        GroupNorm-78            [-1, 256, 8, 8]             512
           Conv2d-79            [-1, 256, 8, 8]         589,824
        GroupNorm-80            [-1, 256, 8, 8]             512
           Conv2d-81           [-1, 1024, 8, 8]         262,144
        GroupNorm-82           [-1, 1024, 8, 8]           2,048
       Bottleneck-83           [-1, 1024, 8, 8]               0
           Conv2d-84            [-1, 256, 8, 8]         262,144
        GroupNorm-85            [-1, 256, 8, 8]             512
           Conv2d-86            [-1, 256, 8, 8]         589,824
        GroupNorm-87            [-1, 256, 8, 8]             512
           Conv2d-88           [-1, 1024, 8, 8]         262,144
        GroupNorm-89           [-1, 1024, 8, 8]           2,048
       Bottleneck-90           [-1, 1024, 8, 8]               0
           Conv2d-91            [-1, 256, 8, 8]         262,144
        GroupNorm-92            [-1, 256, 8, 8]             512
           Conv2d-93            [-1, 256, 8, 8]         589,824
        GroupNorm-94            [-1, 256, 8, 8]             512
           Conv2d-95           [-1, 1024, 8, 8]         262,144
        GroupNorm-96           [-1, 1024, 8, 8]           2,048
       Bottleneck-97           [-1, 1024, 8, 8]               0
           Conv2d-98            [-1, 512, 8, 8]         524,288
        GroupNorm-99            [-1, 512, 8, 8]           1,024
          Conv2d-100            [-1, 512, 4, 4]       2,359,296
       GroupNorm-101            [-1, 512, 4, 4]           1,024
          Conv2d-102           [-1, 2048, 4, 4]       1,048,576
       GroupNorm-103           [-1, 2048, 4, 4]           4,096
          Conv2d-104           [-1, 2048, 4, 4]       2,097,152
       GroupNorm-105           [-1, 2048, 4, 4]           4,096
      Bottleneck-106           [-1, 2048, 4, 4]               0
          Conv2d-107            [-1, 512, 4, 4]       1,048,576
       GroupNorm-108            [-1, 512, 4, 4]           1,024
          Conv2d-109            [-1, 512, 4, 4]       2,359,296
       GroupNorm-110            [-1, 512, 4, 4]           1,024
          Conv2d-111           [-1, 2048, 4, 4]       1,048,576
       GroupNorm-112           [-1, 2048, 4, 4]           4,096
      Bottleneck-113           [-1, 2048, 4, 4]               0
          Conv2d-114            [-1, 512, 4, 4]       1,048,576
       GroupNorm-115            [-1, 512, 4, 4]           1,024
          Conv2d-116            [-1, 512, 4, 4]       2,359,296
       GroupNorm-117            [-1, 512, 4, 4]           1,024
          Conv2d-118           [-1, 2048, 4, 4]       1,048,576
       GroupNorm-119           [-1, 2048, 4, 4]           4,096
      Bottleneck-120           [-1, 2048, 4, 4]               0
          Linear-121                   [-1, 10]          20,490
================================================================
Total params: 23,503,626
Trainable params: 23,503,626
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.06
Forward/backward pass size (MB): 65.13
Params size (MB): 89.66
Estimated Total Size (MB): 154.85
----------------------------------------------------------------
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 16, 32, 32]             432
         GroupNorm-2           [-1, 16, 32, 32]              32
            Conv2d-3           [-1, 16, 32, 32]             256
       BatchNorm2d-4           [-1, 16, 32, 32]              32
            Conv2d-5           [-1, 16, 32, 32]           2,304
       BatchNorm2d-6           [-1, 16, 32, 32]              32
            Conv2d-7           [-1, 64, 32, 32]           1,024
       BatchNorm2d-8           [-1, 64, 32, 32]             128
            Conv2d-9           [-1, 64, 32, 32]           1,024
      BatchNorm2d-10           [-1, 64, 32, 32]             128
       Bottleneck-11           [-1, 64, 32, 32]               0
           Conv2d-12           [-1, 16, 32, 32]           1,024
      BatchNorm2d-13           [-1, 16, 32, 32]              32
           Conv2d-14           [-1, 16, 32, 32]           2,304
      BatchNorm2d-15           [-1, 16, 32, 32]              32
           Conv2d-16           [-1, 64, 32, 32]           1,024
      BatchNorm2d-17           [-1, 64, 32, 32]             128
       Bottleneck-18           [-1, 64, 32, 32]               0
AdaptiveAvgPool2d-19             [-1, 64, 1, 1]               0
           Linear-20                   [-1, 10]             650
================================================================
Total params: 10,586
Trainable params: 10,586
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 5.25
Params size (MB): 0.04
Estimated Total Size (MB): 5.30
-------------------------------------